MacWyznawca/RadioJKK/radioJKK32/sdkconfig.defaults.esp32
CONFIG_IDF_CMAKE=y
CONFIG_IDF_TARGET_ARCH_XTENSA=y
CONFIG_IDF_TARGET="esp32"
CONFIG_IDF_TARGET_ESP32=y
CONFIG_IDF_FIRMWARE_CHIP_ID=0x0000

#
# Audio HAL
#
CONFIG_AUDIO_BOARD_CUSTOM=y

#
# ESP32-specific
#
CONFIG_ESP32_DEFAULT_CPU_FREQ_240=y
CONFIG_ESP32_DEFAULT_CPU_FREQ_MHZ=240
CONFIG_FREERTOS_PLACE_FUNCTIONS_INTO_FLASH=y

#
# ESP32-specific
#
CONFIG_SPIRAM=y

#
# SPI RAM config
#
CONFIG_SPIRAM_CACHE_WORKAROUND=n
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# Override some defaults so BT stack is enabled and
# Classic BT is enabled
# CONFIG_BT_ENABLED=y
# CONFIG_BTDM_CTRL_MODE_BR_EDR_ONLY=y
# CONFIG_BTDM_CONTROLLER_MODE_BR_EDR_ONLY=y
# CONFIG_BTDM_CTRL_PINNED_TO_CORE_1=y
# CONFIG_BLUEDROID_ENABLED=y
# CONFIG_BLUEDROID_PINNED_TO_CORE_1=y
# CONFIG_BLUEDROID_PINNED_TO_CORE=1
# CONFIG_CLASSIC_BT_ENABLED=y
# CONFIG_A2DP_ENABLE=y
# CONFIG_COMPILER_OPTIMIZATION_SIZE=y
# CONFIG_BT_ALLOCATION_FROM_SPIRAM_FIRST=y
# CONFIG_BT_BLE_DYNAMIC_ENV_MEMORY=y

